print('Задача 4. Календари')

# Ваня увлекается историей, а в особенности календарями.
# Он изучает календари разных времён, эпох и народностей.
# Для исследования ему нужно посчитать,
# у кого сколько было месяцев с чётным количеством дней.

# Напишите программу,
# которая считает количество только чётных чисел в последовательности
# (последовательность заканчивается при вводе нуля)
# и выводит ответ на экран.

count_months = 0

while True:
	number = int(input('Введите число: '))
	if number == 0:
		break
	elif number % 2 == 0:
		count_months += 1
print('Колечество чётных месяцев', count_months)
